let s_source = {
	'surnames': ["Летуаль",	"Ледовар",	"Ледокол",	"Литомент",	"Литаврас",	"Ледобас",	"Лореаль",	"Клитовор",	"Литорас",	"Литак",	"Литаврасина",	"Ледамыр",	"Листожор",	"Самовар",	"Сыкватар",	"Литавор (ударение на О)",	"Литавор (ударение на А)",	"Шумовар",	"Ледоруб",	"Мойдодыр",	"Литаворище",	"Жонглёр",	"Матрас",	"Кентавр",	"Минотавр",	"Живодёр",	"Живанши",	"Лионель",	"Леопольд",	"Акварель",	"Линолеум",	"Ювелир",	"Юбиляр",	"Каламбур",	"Цвикль",	"Сыровар",	"Литовский вор",	"Литовский мент",	"Гольджи",	"Годзилла",	"Копатель",	"Лепрекон",	"Литота"],
	'rarity': ["Arcane",	"Rare",	"Rare",	"Rare",	"Rare",	"Common",	"Rare",	"Rare",	"Common",	"Common",	"Common",	"Common",	"Rare",	"Arcane",	"Rare",	"Arcane",	"Arcane",	"Common",	"Common",	"Rare",	"Common",	"Common",	"Common",	"Common",	"Common",	"Rare",	"Common",	"Common",	"Common",	"Common",	"Common",	"Rare",	"Common",	"Common",	"Common",	"Common",	"Common",	"Common",	"Common",	"Common",	"Common",	"Common",	"Common"],
};

var surnames = [];
var surnames_c = [];
var surnames_a = [];
var surnames_r = [];

for (var i = 0; i < s_source['surnames'].length; i++) {
	surnames[surnames.length] = s_source['surnames'][i];
	if (s_source['rarity'][i] == 'Common') {
		surnames_c[surnames_c.length] = s_source['surnames'][i];
	} else if (s_source['rarity'][i] == 'Rare') {
		surnames_r[surnames_r.length] = s_source['surnames'][i];
	} else {
		surnames_a[surnames_a.length] = s_source['surnames'][i];
	}
};

// Common - 75%
// Arcane - 5%
// Rare - 20%
// ======================
var s=surnames.length;
var rs=Math.floor(Math.random()*(s));
console.log("Surname: "+s, rs, surnames[s-1]);
// Sorting
let surnamessort = [];
surnamessort = surnames.slice();
surnamessort.sort();


/* let surnames = 	[
		"Летуаль",
		"Ледовар",
		"Ледокол",
		"Литомент",
		"Литаврас",
		"Ледобас",
		"Лореаль",
		"Клитовор",
		"Литорас",
		"Литак",
		"Литаврасина",
		"Ледамыр",
		"Листожор",
		"Самовар",
		"Сыкватар",
		"Литавор (ударение на О)",
		"Литавор (ударение на А)",
		"Шумовар",
		"Ледоруб",
		"Мойдодыр",
		"Литаворище",
		"Жонглёр",
		"Матрас",
		"Кентавр",
		"Минотавр",
		"Живодёр",
		"Живанши",
		"Лионель",
		"Леопольд",
		"Акварель",
		"Линолеум",
		"Ювелир",
		"Юбиляр",
		"Каламбур",
		"Цвикль",
		"Сыровар",
		"Литовский вор",
		"Литовский мент",
		"Гольджи",
		"Годзилла",
		"Копатель",
		"Лепрекон",
		"Литота",
		];
let surnames_c = 	[
	"Ледобас",
	"Литорас",
	"Литак",
	"Литаврасина",
	"Ледамыр",
	"Шумовар",
	"Ледоруб",
	"Литаворище",
	"Жонглёр",
	"Матрас",
	"Кентавр",
	"Минотавр",
	"Живанши",
	"Лионель",
	"Леопольд",
	"Акварель",
	"Линолеум",
	"Юбиляр",
	"Каламбур",
	"Цвикль",
	"Сыровар",
	"Литовский вор",
	"Литовский мент",
	"Гольджи",
	"Годзилла",
	"Копатель",
	"Лепрекон",
	"Литота",
];
let surnames_a = 	[
	"Летуаль",
	"Самовар",
	"Литавор (ударение на О)",
	"Литавор (ударение на А)",
];
let surnames_r = 	[
	"Ледовар",
	"Ледокол",
	"Литомент",
	"Литаврас",
	"Лореаль",
	"Клитовор",
	"Листожор",
	"Сыкватар",
	"Мойдодыр",
	"Живодёр",
	"Ювелир",
]; */
